Shubuo/SD.SPI.FATFS-Stm32F103/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2018 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"
#include "fatfs.h"

/* USER CODE BEGIN Includes */

#define CMD0 		(0x40+0) // GO_IDLE_STATE
#define CMD1 		(0x40+1) // SEND_OP_COND (MMC)
#define ACMD41 	(0xC0+41) // SEND_OP_COND (SDC)
#define CMD8 		(0x40+8) // SEND_IF_COND
#define CMD9 		(0x40+9) // SEND_CSD
#define CMD16 	(0x40+16) // SET_BLOCKLEN
#define CMD17 	(0x40+17) // READ_SINGLE_BLOCK
#define CMD24 	(0x40+24) // WRITE_BLOCK
#define CMD55 	(0x40+55) // APP_CMD
#define CMD58 	(0x40+58) // READ_OCR

#include <string.h>
#include <stdlib.h>
#include <stdint.h>
#include "SD.h"
#include "LCD162A.h"
#include "ff_gen_drv.h"
#include "user_diskio.h"
#include "stdio.h"
#include "math.h"
#include "stdbool.h"

#define CS_SD_GPIO_PORT 	GPIOA
#define CS_SD_PIN 				GPIO_PIN_3
#define CS_SD_LOW() 			HAL_GPIO_WritePin(CS_SD_GPIO_PORT, CS_SD_PIN, GPIO_PIN_RESET)
#define CS_SD_HIGH() 			HAL_GPIO_WritePin(CS_SD_GPIO_PORT, CS_SD_PIN, GPIO_PIN_SET)

#define HX_SCK_GPIO_PORT 	GPIOC
#define HX_SCK_PIN 				GPIO_PIN_14
#define HX_SCK_LOW() 			HAL_GPIO_WritePin(HX_SCK_GPIO_PORT, HX_SCK_PIN, GPIO_PIN_RESET)
#define HX_SCK_HIGH()			HAL_GPIO_WritePin(HX_SCK_GPIO_PORT, HX_SCK_PIN, GPIO_PIN_SET)

#define HX_DT_GPIO_PORT 	GPIOC
#define HX_DT_PIN 				GPIO_PIN_15
#define HX_DT_LOW() 			HAL_GPIO_WritePin(HX_DT_GPIO_PORT, HX_DT_PIN, GPIO_PIN_RESET)
#define HX_DT_HIGH() 			HAL_GPIO_WritePin(HX_DT_GPIO_PORT, HX_DT_PIN, GPIO_PIN_SET)
#define HX_DT_Read() 			HAL_GPIO_ReadPin(HX_DT_GPIO_PORT, HX_DT_PIN) 

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

RTC_DateTypeDef sDate;
RTC_TimeTypeDef sTime;

extern int 	i;

bool updateRTC;

uint8_t		estado 	= 0;
uint8_t		teste 	= 0;
uint8_t 	result;

uint8_t 	UART_H1[5];
uint8_t 	UART_RX[1];
uint8_t 	UART_TX[8] = "1350.00";

char 					UART_MEA_SEND[8] = {0};
char 					taux1[8];
char 					taux[3];
unsigned long	sensor[20] = {0};

// ----------------------------------- MEDICAO -------------------------------------

double 	Vector_MEA[100] 			= {0};
double 	Vector_Last_MEA[100] 	= {0};
double 	Tara 									= 0;
double 	aForce								= 0;
double 	Force 								= 0;
bool		Not_Busy 							= true;
double	Maior_Valor						= 0;

// ----------------------------------- uSD -------------------------------------

FATFS 			SDFatFs;
FATFS 			*fs;
FIL 				MyFile;
FRESULT     res;
char 				USER_Path[4]; /* logical drive path */

// ----------------------------------- RTC -------------------------------------

signed int	horas 		= 12;
signed int	minutos 	= 30;
signed int	segundos 	= 50;
signed int	dia 			= 15;
signed int	mes 			= 06;
signed int  ano 			= 18;

// ----------------------------------- Kalman`s FILTER -------------------------------------

float 	KG 				= 0 ;
float 	MEA 			= 0;
float 	ERROR_E0 	= 20;
float 	ERROR_E1 	= 0;
int			ERROR_MEA = 5;
double 	E_E0 			= 0;					//Estimativa Futura - Primeira previsao = Tara
double 	E_E1 			= 0;					//Estimativa Passada

// ----------------------------------- FIR FILTER -------------------------------------------

