Shubuo/SD.SPI.FATFS-Stm32F103/main.c
// Hamming Window (11)
//double			FIR_C[] = {0.0145489741947061	,0.0305712499252980	,0.0725451577608892	,0.124486576686153	,0.166541934360414	,0.182612214145080,	0.166541934360414,	0.124486576686153,	0.0725451577608892,	0.0305712499252980	,0.0145489741947061	};

// Triangular (16)
double			FIR_C[] = {0.0610597081690606,	0.0616322647111381	,0.0621255648055849	,0.0625384434486763,	0.0628699247468551	,0.0631192246649620,	0.0632857532350082	,0.0633691162187148,	0.0633691162187148	,0.0632857532350082,	0.0631192246649620	,0.0628699247468551,	0.0625384434486763,	0.0621255648055849	,0.0616322647111381	,0.0610597081690606};



// ----------------------------------- IIR FILTER: -------------------------------------------
double 			sumA 			= 0;
double 			sumB 			= 0;
double 			IIR_B[3] 	= {0.000238	,0.000476,	0.000238};
double 			IIR_A[3] 	= {1, -1.9650,	0.9661};	
double 			y[10] 		= {0};

	
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_RTC_Init(void);
static void MX_SPI2_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_TIM4_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/


/* USER CODE END PFP */

/* USER CODE BEGIN 0 */



void					FIR_vector(int M, double vector[],double vector_F[],int N){
	
	double				ss[100] = {0};
	unsigned long sum = 0;
	int						count =0;
	int						it    =0;

	for(i=0;i<N;i++){										
		
		ss[i] = vector[i];
		
	}
	
	for(it=0;it<N;it++){
		
			sum = 0;
			
			for(i=0;i<M;i++){
				
				sum = sum + ss[i]*FIR_C[i];	  // 16 valores 
			}
			
			vector_F[count] = sum;
			count++;
			
			for(i=0;i<(N-1);i++){										
				ss[i] = ss[i+1];         
			}	
	}
}

	FRESULT open_append (
    FIL* fp,            /* [OUT] File object to create */
    const char* path    /* [IN]  File name to be opened */
	)
	{
    FRESULT fr;
		FRESULT aux;

    /* Opens an existing file. If not exist, creates a new file. */
		
    fr = f_open(fp, path, FA_WRITE | FA_OPEN_ALWAYS);
    if (fr == FR_OK) {
        /* Seek to end of the file to append data */
        aux = f_lseek(fp, f_size(fp));
        if (aux != FR_OK)
            f_close(fp);
    }
    return fr;
}
	

void 					Update_RTC(void){
	
	HAL_RTC_GetTime(&hrtc,&sTime,RTC_FORMAT_BIN);
	HAL_RTC_GetDate(&hrtc,&sDate,RTC_FORMAT_BIN);
	minutos = sTime.Minutes;	
	horas = sTime.Hours;
	dia = sDate.Date;
	mes = sDate.Month;
	ano =	sDate.Year;
}
void 					Update_From_User_RTC(void){
	
	horas 	= UART_H1[0];
	minutos = UART_H1[1];
	dia 		= UART_H1[2];
	mes 		= UART_H1[3];
	ano 		= UART_H1[4];
	
	
	sTime.Minutes = minutos;	
	sTime.Hours = horas;
	sDate.Date = dia;
	sDate.Month = mes;
	sDate.Year = ano;
	HAL_RTC_SetTime(&hrtc,&sTime,RTC_FORMAT_BIN);
	HAL_RTC_SetDate(&hrtc,&sDate,RTC_FORMAT_BIN);
}
void 					LCD_ShowRTC(void){
	
	sprintf(taux1,"%02d/%02d/%02d",dia,mes,ano);
	LCD_CURSOR(1,8);	
  ENVIA_STRING_LCD(taux1);
	LCD_CURSOR(0,11);	
	sprintf(taux,"%02d:%02d",horas,minutos);
	ENVIA_STRING_LCD(taux);
	LCD_CURSOR(1,20);

}

void 					SD_Backup(unsigned long dataForce){
	
	//  Inicializacao uSD	
			
	disk_initialize(SDFatFs.drv);
					
				if(SD_Init() != 0){
					
					LCD_LIMPA();
					ENVIA_STRING_LCD("NO SD");
					HAL_Delay(500);
				}
				else{					
					if(f_mount(&SDFatFs,(const char*)USER_Path,0)!= FR_OK){
								LCD_LIMPA();
								ENVIA_STRING_LCD("OPEN ERROR 1");
					}
					else{
								
						if(open_append(&MyFile,"MEDICAO.txt") != FR_OK){						
								LCD_LIMPA();
								ENVIA_STRING_LCD("OPEN ERROR 2");																
					}
							else{														
								Update_RTC();					
								f_printf(&MyFile, "Data: %02u/%02u/%u, %2u:%02u\n",dia,mes,ano,horas,minutos);
								f_printf(&MyFile, "FORCA: %lu \n",dataForce);			
								f_close(&MyFile);
								
								
							
								LCD_LIMPA();
								ENVIA_STRING_LCD("Saved...");
								HAL_Delay(800); 
					}					 
				}
			}							
				FATFS_UnLinkDriver(USER_Path);
	}

unsigned long ReadCount(void){
	
	unsigned long Count;
	unsigned char i;
	
	HX_DT_HIGH(); //ADDO=1;
	HX_SCK_LOW(); //ADSK=0;
	
	Count=0;
  while(HX_DT_Read()); 				//while(ADDO); 
	
	for (i=0;i<24;i++){
		HX_SCK_HIGH(); 						//ADSK=1;
		Count=Count<<1;
		HX_SCK_LOW();							//ADSK=0;
		if(HX_DT_Read()) Count++;		//if(ADDO)
	}
	
	HX_SCK_HIGH();								//ADSK=1;
	Count=Count^0x800000;
	HX_SCK_LOW();								//ADSK=0;
	return(Count);
} 

unsigned long moving_average(int M){
	
	unsigned long sum = 0;

	for(i=M;i>0;i--){
		
		sensor[i] = sensor[i-1];
	}
	
	sensor[0] = ReadCount();
	sum = 0;
	
	for(i=0;i<M;i++){
		
		sum = sum + sensor[i];	
	}
	
	return sum/M;

}


double 				FIR(int M){
	
	unsigned long sum = 0;

	for(i=M;i>0;i--){
		
		sensor[i] = sensor[i-1];
	}
	
	sensor[0] = ReadCount();
	sum = 0;
	
	for(i=0;i<M;i++){
		
		sum = sum + sensor[i]*FIR_C[i];	
	}
	
	return sum;

}

double 				IIR(int M){
	
	
	for(i=M;i>0;i--){
		
		sensor[i] = ReadCount();
	}
	
	sensor[0] = ReadCount();
	
	sumA = 0;
	sumB = 0;
	
	for(i=0;i<M;i++){
		
		sumB = sumB + sensor[i]*IIR_B[i];	
		
	}
	
	for(i=0;i<(M-1);i++){
	
		sumA = sumA + y[i]*IIR_A[i+1];
	}
			
	for(i=0;i<M;i++){
	
		y[i+1] = y[i];
	}	
	
	y[0] = sumB - sumA;
	
	return (sumB - sumA);
	
}

double 				Kalmans(void){
	
	// Valor Medido
	MEA = ReadCount();
	
	// Kalmans Filter Gain
	KG = ERROR_E0/(ERROR_E0 + ERROR_MEA);
		
	// Updating Estimative
	E_E1 = E_E0;
	E_E0 = E_E1 + KG*(MEA - E_E1);
	
	// Updating Error	
	ERROR_E1 = ERROR_E0;	
	ERROR_E0 = (1-KG)*ERROR_E1;
	
	return E_E0;
	
	
}

double 				Get_Tara(void){
	
	long 	auxTara 	= 0;
	long 	auxTara2 	= 0;
							
	for(i=0;i<20;i++){
		
		auxTara = ReadCount();
		auxTara2 += auxTara;
		
