Shubuo/SD.SPI.FATFS-Stm32F103/main.c
	}
					
	Tara = auxTara2/20;
	return Tara;
}
void 					Wait_Start_Measuring(int Peso_Minimo){
	
	
	for(i=0;i<10;i++)
	aForce = ReadCount();	
	
	Force = fabs((aForce - Tara)*(0.00238));
	
	while(estado == 0x01 && Force < Peso_Minimo){	
		
		aForce = ReadCount();	
		Force = fabs((aForce - Tara)*(0.00238));
	}
	
}
void 					Measuring(void){
		
	while(estado == 0x01 && Force > 100){	
		
						aForce = ReadCount();	
						Force = fabs((aForce - Tara)*(0.00238));
		
						LCD_CURSOR(0,0);
						sprintf(UART_MEA_SEND,"%7.2f",Force);						
						ENVIA_STRING_LCD(UART_MEA_SEND);				
						HAL_UART_Transmit_IT(&huart3, UART_MEA_SEND ,sizeof(UART_MEA_SEND));
	}
	
}
void 					Measuring_Vector(double Aux_Vector[]){
	
	int m =0;
	
	while(estado == 0x01 && Force > 100){	
		
		aForce = ReadCount();	
		Force = fabs((aForce - Tara)*(0.00238));
		Aux_Vector[m] = Force;
		m++;		
		
	}
	
}
double 				Maior_Valor_Vector(double Aux_Vector[]){
	
	int m =1;
	double Maior_Valor_Function =0;
	
	for(i=1;i<100;i++){
			
			if(Aux_Vector[m] > Aux_Vector[m-1]){
			
				Maior_Valor_Function = Aux_Vector[m];
			}	
		
		m++;		
		}
	
		return Maior_Valor_Function;
	}
	

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	
	

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
	
	
	
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_FATFS_Init();
  MX_RTC_Init();
  MX_SPI2_Init();
  MX_USART3_UART_Init();
  MX_TIM4_Init();
  /* USER CODE BEGIN 2 */
	
	LCD_INICIALIZA();
	HAL_TIM_Base_Start_IT(&htim4);
	__HAL_UART_ENABLE_IT(&huart3,UART_IT_RXNE);	
	__HAL_UART_ENABLE_IT(&huart3,UART_IT_TXE);	
	ENVIA_STRING_LCD("MENU");

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1){
		
		
		 switch(estado){
			
			case 0x01:
			{				
				if(teste != 1){
					LCD_LIMPA();
					ENVIA_STRING_LCD("INICIAR");
					teste = 1;						
				}		
					LCD_LIMPA();
					ENVIA_STRING_LCD("Tara");
					Tara = Get_Tara();
					LCD_LIMPA();
					for(i=0;i<100;i++){
						Vector_MEA[i] = 0;
					}
					ENVIA_STRING_LCD("Aguardando Ini.");
					Wait_Start_Measuring(100);
					LCD_LIMPA();
					//Measuring();
					Measuring_Vector(Vector_MEA);
					Maior_Valor = Maior_Valor_Vector(Vector_MEA);
					for(i=0;i<100;i++)
						Vector_Last_MEA[i] = Vector_MEA[i];
					
					sprintf(UART_MEA_SEND,"%7.2f",Maior_Valor);						
					ENVIA_STRING_LCD(UART_MEA_SEND);				
					HAL_UART_Transmit_IT(&huart3, UART_MEA_SEND ,sizeof(UART_MEA_SEND));
					
					
					
			break; 
			}
			
			case 0x03:
			{					
				if(teste != 1){
					LCD_LIMPA();
					ENVIA_STRING_LCD("GRAFICO");
					teste = 1;
				}
							      
			break; 
			}
			
			case 0x05:
			{					
				if(teste != 1){
					LCD_LIMPA();
					ENVIA_STRING_LCD("RTC");
					teste = 1;
				}
				
			break; 
			}
			
			case 0x09:
			{					
				if(teste != 1){
					LCD_LIMPA();
					ENVIA_STRING_LCD("MENU");
					teste = 1;
					
					if(updateRTC){
						Update_From_User_RTC();
						updateRTC = false;
					}
				}
							      
			break; 
			}
		}
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
	
	//	HAL_UART_Transmit(&huart3, UART_TX, sizeof(UART_TX),100);
	//	HAL_Delay(500);

  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC;
  PeriphClkInit.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* RTC init function */
static void MX_RTC_Init(void)
{

  RTC_TimeTypeDef sTime;
  RTC_DateTypeDef DateToUpdate;

    /**Initialize RTC Only 
    */
  hrtc.Instance = RTC;
  if(HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR1) != 0x32F2){
  hrtc.Init.AsynchPrediv = RTC_AUTO_1_SECOND;
  hrtc.Init.OutPut = RTC_OUTPUTSOURCE_ALARM;
  if (HAL_RTC_Init(&hrtc) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

